#Область Чат

&НаКлиенте
Процедура ЧатHTMLДокументСформирован(Элемент)		
	// Если мы выходим из формы и присвоили HTML = "<exit>" то пропускаем
	Если ЧатHTML = "<exit>" Тогда Возврат КонецЕсли;
	
	// Если ЧатHTML еще не заполнен - заполняем
	Если ПустаяСтрока(ЧатHTML) Тогда Чат.ЗаполнитьЧат(ЧатHTML); Возврат КонецЕсли;
	
	// Немного магии, чтоб смочь обращаться к глобальным переменным и функциям JS
	ОкноЧата	= Элементы.ЧатHTML.Документ.defaultView;	
	Если ОкноЧата = Неопределено Тогда ОкноЧата	= Элементы.ЧатHTML.Документ.parentWindow КонецЕсли;
	
	ОкноЧата.externalModule	= Чат;	// Позволяем JS чату вызывать общий модуль "Чат"
	ОкноЧата.getGroups();			// Говорим чату, что пора вывести список групп
КонецПроцедуры // ЧатHTMLДокументСформирован()

&НаКлиенте
Процедура ЗакрытьЧат()
	Попытка
		СисИнфо	= Новый СистемнаяИнформация;
		Если Не СтрНайти(СисИнфо.ВерсияОС, "Windows") Тогда Возврат КонецЕсли; 

		Сообщить("Закрываем чат в " + ЭтаФорма.ИмяФормы);
		Если Элементы.ЧатHTML.Документ = Неопределено Тогда Возврат КонецЕсли;
		ОкноЧата	= Элементы.ЧатHTML.Документ.defaultView;	
		Если ОкноЧата = Неопределено Тогда ОкноЧата	= Элементы.ЧатHTML.Документ.parentWindow КонецЕсли;
		//ОкноЧата.stopTimer();
		ОкноЧата.clearInterval(ОкноЧата.timer);
		ОкноЧата.timer			= Null;
		ОкноЧата.externalModule	= Null;
		//ОкноЧата.Close();
		ЧатHTML					= "<exit>";
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры // ЗакрытьЧат()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЧатHTML <> "<exit>" Тогда ЗакрытьЧат(); КонецЕсли;
КонецПроцедуры // ПередЗакрытием()


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытьЧат" Тогда ЗакрытьЧат(); ЭтаФорма.Закрыть(); КонецЕсли;
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти
